[
  {
    "plantId": 1,
    "plantName": "Rubber Plant",
    "category": "Air Purifier",
    "price": 25,
    "rating": 4.6,
    "availableStock": 9,
    "careLevel": "Easy",
    "lightRequirement": "Medium indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium (2-3 ft)",
    "origin": "Southeast Asia",
    "benefits": "Removes toxins, improves air quality, aesthetic appeal",
    "description": "The Rubber Plant is a stylish indoor plant with broad, glossy leaves that thrive in medium light. Its dark green foliage adds a modern touch to any home or office interior. This plant is known for its air-purifying qualities, effectively removing toxins from the environment and promoting cleaner, healthier air. It requires minimal maintenance, making it ideal for both beginner and experienced plant enthusiasts. Regular watering once a week, along with occasional pruning of older leaves, ensures optimal growth. Its medium size fits perfectly in living rooms, bedrooms, or office corners, adding elegance and greenery. Overall, it brings both aesthetic and functional value to indoor spaces.",
    "image": "https://plus.unsplash.com/premium_photo-1680528165482-2b008fa8fa41?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NXx8cnViYmVyJTIwdHJlZXxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&q=60&w=900",
    "providerName": "EverGreen Living"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering Indoor",
    "price": 22,
    "rating": 4.9,
    "availableStock": 8,
    "careLevel": "Medium",
    "lightRequirement": "Low to medium indirect light",
    "waterFrequency": "Twice a week",
    "size": "Medium (1.5-2 ft)",
    "origin": "Tropical Americas",
    "benefits": "Air purification, aesthetic blooms, easy care",
    "description": "Peace Lily is a graceful indoor plant featuring glossy, dark green leaves and elegant white flowers. It is highly valued for its air-purifying abilities, removing mold spores and toxins from the indoor environment, creating a healthier living space. Peace Lily thrives in low to medium indirect light, making it suitable for homes and offices with limited sunlight. Watering twice a week keeps the soil moist without overwatering. Its moderate size and delicate blooms make it perfect for tabletops, shelves, or corners, bringing a touch of sophistication. Additionally, Peace Lily is known to improve humidity levels, which is beneficial for skin and respiratory health. This plant is both visually pleasing and functional, offering a serene indoor atmosphere.",
    "image": "https://images.unsplash.com/photo-1721537107470-0bc7e2d368f3?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8bGlseSUyMGZsb3dlcnxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&q=60&w=900",
    "providerName": "LeafyComfort Co."
  },
  {
    "plantId": 3,
    "plantName": "Fiddle Leaf Fig",
    "category": "Statement Plant",
    "price": 45,
    "rating": 4.5,
    "availableStock": 5,
    "careLevel": "Medium-Hard",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Once a week",
    "size": "Large (4-6 ft)",
    "origin": "Western Africa",
    "benefits": "Bold aesthetic, air purification, statement plant",
    "description": "The Fiddle Leaf Fig is a striking statement plant known for its large, violin-shaped leaves and towering presence. Perfect for modern interiors, it adds drama and sophistication to living rooms, hallways, or office spaces. This plant prefers bright, indirect light and requires careful watering once a week to avoid root rot. Its lush green foliage not only enhances interior aesthetics but also helps in purifying indoor air by removing toxins and improving oxygen levels. Occasional wiping of leaves ensures dust-free foliage and promotes healthy growth. Ideal for plant enthusiasts who enjoy cultivating bold, eye-catching indoor plants, the Fiddle Leaf Fig serves as both a decorative and functional addition to any space, creating a natural focal point.",
    "image": "https://plus.unsplash.com/premium_photo-1664475112250-7a6e659807b3?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mjl8fEZpZGRsZSUyMExlYWYlMjBGaWd8ZW58MHx8MHx8fDA%3D&auto=format&fit=crop&q=60&w=900",
    "providerName": "GreenCanvas Interiors"
  },
  {
    "plantId": 4,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 25,
    "rating": 4.7,
    "availableStock": 12,
    "careLevel": "Easy",
    "lightRequirement": "Bright indirect to direct light",
    "waterFrequency": "Every 2-3 weeks",
    "size": "Small to medium (1-2 ft)",
    "origin": "Arabian Peninsula",
    "benefits": "Medicinal properties, air purification, low maintenance",
    "description": "Aloe Vera is a versatile succulent loved for its medicinal and decorative properties. Its thick, fleshy leaves store water, allowing it to survive in low-maintenance indoor environments. Aloe Vera thrives in bright indirect or direct sunlight, making it suitable for sunny windowsills. Known for its soothing gel that can be used for skin care, minor burns, and moisturizing, it is both functional and beautiful. Watering every 2-3 weeks is sufficient, ensuring the roots don’t rot. The plant improves indoor air quality by absorbing pollutants, and its green hue enhances any interior décor. Aloe Vera is perfect for health-conscious plant lovers and low-maintenance indoor gardens.",
    "image": "https://plus.unsplash.com/premium_photo-1688045553706-e2c642bfa410?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8YWxvZSUyMHZlcmElMjBwbGFudHxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&q=60&w=900",
    "providerName": "SucculentHaven"
  },
  {
    "plantId": 5,
    "plantName": "Monstera Deliciosa",
    "category": "Tropical Indoor",
    "price": 38,
    "rating": 4.6,
    "availableStock": 6,
    "careLevel": "Medium",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Once a week",
    "size": "Large (3-5 ft)",
    "origin": "Central America",
    "benefits": "Tropical aesthetic, air purification, iconic leaves",
    "description": "Monstera Deliciosa, also known as the Swiss Cheese Plant, is famous for its large, perforated leaves that bring a tropical vibe to any indoor space. It thrives in bright indirect light and requires moderate watering once a week. Its bold foliage not only enhances the aesthetic of living rooms and offices but also acts as a natural air purifier. Easy to train and support, Monstera can climb or trail with proper guidance. Regularly dusting the leaves ensures they stay glossy and healthy. Its medium to large size makes it perfect as a centerpiece or corner plant. Overall, it combines tropical elegance with functional indoor benefits, making it a favorite for plant enthusiasts.",
    "image": "https://images.unsplash.com/photo-1636525653613-2a3a05c00759?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8TW9uc3RlcmElMjBEZWxpY2lvc2F8ZW58MHx8MHx8fDA%3D&auto=format&fit=crop&q=60&w=900",
    "providerName": "TropiLeaf Designs"
  },
  {
    "plantId": 6,
    "plantName": "Spider Plant",
    "category": "Beginner Friendly",
    "price": 20,
    "rating": 4.8,
    "availableStock": 15,
    "careLevel": "Easy",
    "lightRequirement": "Indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium (1-2 ft)",
    "origin": "South Africa",
    "benefits": "Air purification, beginner-friendly, decorative",
    "description": "Spider Plant is a vibrant indoor plant with long, arching leaves featuring green and white stripes. It is extremely beginner-friendly and thrives in indirect light, making it ideal for offices, bedrooms, and hanging baskets. Spider Plant is well-known for its air-purifying capabilities, effectively removing pollutants like formaldehyde from indoor spaces. Watering once a week keeps it healthy, while occasional pruning of brown tips maintains a neat appearance. Spider Plants produce small offshoots or 'pups' that can be propagated easily, adding to its charm. With minimal care and high adaptability, it is perfect for anyone looking to add greenery and freshness to their home environment.",
    "image": "https://images.unsplash.com/photo-1610551724444-5fb527b5ad20?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTB8fFNwaWRlciUyMFBsYW50fGVufDB8fDB8fHww&auto=format&fit=crop&q=60&w=900",
    "providerName": "HangingGreen Studios"
  },

  {
    "plantId": 7,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 28,
    "rating": 4.7,
    "availableStock": 10,
    "careLevel": "Easy",
    "lightRequirement": "Low to bright indirect light",
    "waterFrequency": "Every 2 weeks",
    "size": "Medium (2-3 ft)",
    "origin": "West Africa",
    "benefits": "Removes toxins, easy maintenance, beginner-friendly",
    "description": "Snake Plant, also known as Mother-in-law’s Tongue, is a hardy indoor plant that thrives in a wide range of lighting conditions, from low light to bright indirect sunlight. Its tall, upright leaves with striking variegation not only add a modern, sculptural element to any room but also help purify the air by removing toxins such as formaldehyde and benzene. Watering every two weeks is sufficient, making it ideal for busy individuals or beginners. The plant is nearly indestructible, resistant to pests, and can tolerate periods of neglect. Its medium size fits beautifully in corners, living rooms, or offices, making it both decorative and functional for indoor spaces.",
    "image": "https://plus.unsplash.com/premium_photo-1673969608223-4e9bce1e700c?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MjV8fFNuYWtlJTIwUGxhbnR8ZW58MHx8MHx8fDA%3D",
    "providerName": "GreenLeaf Studio"
  },
  {
    "plantId": 8,
    "plantName": "Orchid",
    "category": "Flowering Indoor",
    "price": 40,
    "rating": 4.9,
    "availableStock": 7,
    "careLevel": "Medium",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium (1.5-2 ft)",
    "origin": "Asia",
    "benefits": "Beautiful blooms, enhances indoor aesthetics, air purification",
    "description": "Orchids are elegant flowering plants prized for their intricate, colorful blooms and long-lasting flowers. They thrive in bright, indirect light and need careful watering once a week to maintain optimal health. Orchids improve indoor air quality by absorbing carbon dioxide and releasing oxygen. Perfect for homes and offices, they bring a touch of sophistication, luxury, and tranquility. While moderately easy to care for, their stunning flowers reward consistent attention. Orchids can bloom for weeks, making them ideal centerpieces for tables, shelves, or window sills. Their unique shapes and colors enhance interior aesthetics, creating a calm and visually appealing environment that complements modern and classic décor.",
    "image": "https://images.unsplash.com/photo-1622050025619-ea3f042f1516?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MjZ8fE9yY2hpZHxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "Bloomy Home"
  },
  {
    "plantId": 9,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 30,
    "rating": 4.5,
    "availableStock": 8,
    "careLevel": "Easy",
    "lightRequirement": "Bright indirect to direct light",
    "waterFrequency": "Every 2-3 weeks",
    "size": "Small (1-2 ft)",
    "origin": "South Africa",
    "benefits": "Good luck, low maintenance, decorative",
    "description": "The Jade Plant is a succulent known for its thick, glossy, oval-shaped leaves and ease of care. Often considered a symbol of good luck and prosperity, it brings both aesthetic and symbolic value to indoor spaces. Thriving in bright indirect to direct light, it requires minimal watering every 2-3 weeks, making it perfect for beginners or busy individuals. The plant grows slowly, allowing it to maintain a compact, decorative form suitable for desktops, shelves, or windowsills. Its fleshy leaves store water efficiently, making it drought-tolerant. Jade Plant also adds a touch of greenery to modern or traditional interiors, creating a soothing and natural atmosphere while requiring very little maintenance.",
    "image": "https://images.unsplash.com/photo-1616189597001-9046fce2594d?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8SmFkZSUyMFBsYW50fGVufDB8fDB8fHww",
    "providerName": "SucculentHaven"
  },
  {
    "plantId": 10,
    "plantName": "Boston Fern",
    "category": "Air Purifier",
    "price": 27,
    "rating": 4.6,
    "availableStock": 12,
    "careLevel": "Medium",
    "lightRequirement": "Indirect light",
    "waterFrequency": "3 times a week",
    "size": "Medium (2-3 ft)",
    "origin": "Tropical Americas",
    "benefits": "Air purification, adds lush greenery, decorative",
    "description": "Boston Fern is a lush, feathery indoor plant that brings a refreshing, natural ambiance to homes and offices. Its vibrant green fronds thrive in indirect light and need consistent watering three times a week to maintain healthy, cascading foliage. Known for its air-purifying properties, Boston Fern removes indoor pollutants and adds oxygen, creating a cleaner environment. This plant is ideal for hanging baskets, shelves, or tabletops, making spaces feel more vibrant and alive. Regular misting helps maintain humidity and prevents fronds from browning. Boston Fern is moderately easy to care for and adds both visual appeal and functional benefits, making it perfect for plant enthusiasts who love dense greenery indoors.",
    "image": "https://images.unsplash.com/photo-1515054788900-574580f821ad?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8Qm9zdG9uJTIwRmVybnxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "LeafyComfort Co."
  },
  {
    "plantId": 11,
    "plantName": "Lavender",
    "category": "Flowering Indoor",
    "price": 35,
    "rating": 4.7,
    "availableStock": 5,
    "careLevel": "Medium",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium (1.5-2 ft)",
    "origin": "Mediterranean",
    "benefits": "Fragrant, calming, decorative",
    "description": "Lavender is a fragrant indoor flowering plant known for its soothing aroma and vibrant purple blooms. It thrives in bright indirect light and requires moderate watering once a week to keep its soil lightly moist. Lavender is widely appreciated for its calming effects, helping reduce stress and promote relaxation. Its attractive flowers and foliage enhance indoor décor, making it perfect for bedrooms, living areas, or office spaces. Regular pruning encourages fuller growth and prolongs blooming periods. Lavender also contributes to improved air quality and acts as a natural insect repellent. Its delightful scent and visually pleasing appearance make it an ideal choice for plant lovers seeking both beauty and wellness indoors.",
    "image": "https://images.unsplash.com/photo-1611625105602-42ee06be977e?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8TGF2ZW5kZXJ8ZW58MHx8MHx8fDA%3D",
    "providerName": "Bloomy Home"
  },

  {
    "plantId": 12,
    "plantName": "Cactus Mix",
    "category": "Succulent",
    "price": 18,
    "rating": 4.5,
    "availableStock": 20,
    "careLevel": "Easy",
    "lightRequirement": "Direct sunlight",
    "waterFrequency": "Every 3-4 weeks",
    "size": "Small (0.5-1 ft)",
    "origin": "Mexico",
    "benefits": "Low maintenance, decorative, drought-tolerant",
    "description": "Cactus Mix is a curated collection of small, easy-care cacti perfect for indoor spaces, desktops, or small shelves. These resilient plants thrive under direct sunlight and require minimal watering every 3-4 weeks, making them ideal for busy individuals or beginners. Each cactus has a unique shape, texture, and sometimes tiny flowers, bringing visual interest and a modern aesthetic to your interior. Beyond decoration, cacti are known for their air-purifying properties and their ability to create a calm and minimalist vibe. They are drought-tolerant, resilient to neglect, and can live for years with minimal maintenance. Placing them together creates a charming mini desert garden indoors.",
    "image": "https://plus.unsplash.com/premium_photo-1673650901045-ebe3ec8b2af1?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mjl8fENhY3R1cyUyME1peHxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "SucculentHaven"
  },
  {
    "plantId": 13,
    "plantName": "Bamboo Palm",
    "category": "Air Purifier",
    "price": 32,
    "rating": 4.6,
    "availableStock": 7,
    "careLevel": "Medium",
    "lightRequirement": "Indirect light",
    "waterFrequency": "Twice a week",
    "size": "Medium (2-3 ft)",
    "origin": "Central Africa",
    "benefits": "Air purification, aesthetic appeal, tropical look",
    "description": "Bamboo Palm is an elegant indoor plant that brings tropical vibes and lush greenery to any interior space. Its slender, tall stems and graceful green leaves make it an attractive decorative piece for homes, offices, or studios. This plant thrives in indirect light and requires moderate watering twice a week to maintain healthy, vibrant foliage. Bamboo Palm helps improve air quality by filtering toxins such as formaldehyde and benzene, contributing to a healthier indoor environment. It is moderately easy to care for, making it suitable for both plant enthusiasts and beginners. Placed in corners or near windows, Bamboo Palm adds a refreshing, serene, and natural feel to your living spaces.",
    "image": "https://images.unsplash.com/photo-1587357601491-e135addf71e9?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OTh8fEJhbWJvbyUyMFBhbG18ZW58MHx8MHx8fDA%3D",
    "providerName": "GreenLeaf Studio"
  },
  {
    "plantId": 14,
    "plantName": "Begonia",
    "category": "Flowering Indoor",
    "price": 26,
    "rating": 4.5,
    "availableStock": 9,
    "careLevel": "Medium",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Twice a week",
    "size": "Small (1-1.5 ft)",
    "origin": "Tropical Americas",
    "benefits": "Colorful leaves, blooms, decorative",
    "description": "Begonia is a vibrant flowering indoor plant known for its colorful leaves and charming blooms. It thrives in bright, indirect light and requires watering twice a week to maintain soil moisture without overwatering. Begonias add a lively splash of color to any room and are ideal for tabletops, shelves, or window sills. Their unique leaf patterns and delicate flowers create visual interest and elevate indoor décor instantly. They are moderately easy to care for, making them perfect for both beginners and experienced plant lovers. Begonias not only enhance the aesthetic appeal but also bring a cheerful and refreshing ambiance indoors, transforming plain corners into lush green spaces.",
    "image": "https://images.unsplash.com/photo-1719847241266-e318372b2e13?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8QmVnb25pYXxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "Bloomy Home"
  },
  {
    "plantId": 15,
    "plantName": "ZZ Plant",
    "category": "Beginner Friendly",
    "price": 29,
    "rating": 4.7,
    "availableStock": 6,
    "careLevel": "Easy",
    "lightRequirement": "Low to bright indirect light",
    "waterFrequency": "Every 2-3 weeks",
    "size": "Medium (1.5-2.5 ft)",
    "origin": "Eastern Africa",
    "benefits": "Air purification, low maintenance, decorative",
    "description": "The ZZ Plant is an almost indestructible indoor plant that thrives in low to bright indirect light and requires minimal watering every 2-3 weeks. Its glossy, dark green leaves grow in a symmetrical pattern, giving it a modern, elegant look suitable for offices, living rooms, and bedrooms. Known for its air-purifying qualities, it removes toxins like xylene, toluene, and benzene, promoting a healthier indoor environment. ZZ Plant is ideal for beginners due to its resilience, low maintenance needs, and ability to tolerate neglect. It adds a lush, tropical feel to interiors and can complement modern, minimalist, or traditional décor seamlessly. Its sturdy nature makes it perfect for busy plant lovers or urban spaces.",
    "image": "https://images.unsplash.com/photo-1714507770401-cecd5ff44d1a?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8WlolMjBQbGFudHxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "EverGreen Living"
  },
  {
    "plantId": 16,
    "plantName": "Anthurium",
    "category": "Flowering Indoor",
    "price": 42,
    "rating": 4.8,
    "availableStock": 4,
    "careLevel": "Medium",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium (1.5-2 ft)",
    "origin": "South America",
    "benefits": "Colorful spathes, air purification, aesthetic appeal",
    "description": "Anthurium, commonly known as the flamingo flower, is a tropical indoor plant celebrated for its vibrant, heart-shaped spathes and glossy green leaves. It flourishes in bright indirect light and needs watering once a week to keep the soil evenly moist. The plant purifies the air, removes harmful toxins, and adds a sophisticated tropical aesthetic to living rooms, offices, or study areas. Anthurium blooms continuously under proper care, offering long-lasting flowers that brighten any interior. This moderately easy-care plant is ideal for enthusiasts who want colorful foliage and striking flowers without high maintenance demands. Anthurium makes a bold statement as a centerpiece or decorative accent.",
    "image": "https://images.unsplash.com/photo-1677187458187-d92f24078e4d?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MjZ8fEFudGh1cml1bXxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "LeafyComfort Co."
  },
  {
    "plantId": 17,
    "plantName": "Dracaena Marginata",
    "category": "Statement Plant",
    "price": 36,
    "rating": 4.5,
    "availableStock": 7,
    "careLevel": "Medium",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium-Large (3-4 ft)",
    "origin": "Madagascar",
    "benefits": "Tall aesthetic, air purification, modern interior",
    "description": "Dracaena Marginata is a striking statement plant known for its slender, upright leaves with red edges that create a bold, modern visual effect indoors. Thriving in bright indirect light, it requires moderate watering once a week to maintain lush foliage. This tropical plant helps purify indoor air by filtering pollutants and enhances any living space with its dramatic vertical growth. Ideal for offices, living rooms, or corners that need a touch of greenery, it adds height and elegance to interiors. Dracaena Marginata is moderately easy to care for and can tolerate some neglect, making it suitable for both beginners and experienced plant enthusiasts looking for a unique statement plant.",
    "image": "https://images.unsplash.com/photo-1667391984020-3384a37fecc4?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTIyfHxEcmFjYWVuYSUyME1hcmdpbmF0YXxlbnwwfHwwfHx8MA%3D%3D",
    "providerName": "GreenCanvas Interiors"
  },
  {
    "plantId": 18,
    "plantName": "Calathea",
    "category": "Decorative Foliage",
    "price": 33,
    "rating": 4.6,
    "availableStock": 6,
    "careLevel": "Medium",
    "lightRequirement": "Indirect light",
    "waterFrequency": "Twice a week",
    "size": "Medium (1.5-2.5 ft)",
    "origin": "Tropical Americas",
    "benefits": "Colorful foliage, decorative, air purification",
    "description": "Calathea is a decorative indoor plant admired for its striking foliage with intricate patterns and vibrant colors. It grows well in indirect light and needs consistent watering twice a week to maintain the moisture and vibrancy of its leaves. Known for its air-purifying abilities, Calathea improves indoor air quality while creating a lush, tropical feel. Its leaves often fold at night, adding a dynamic and lively element to any room. Perfect for living rooms, offices, or bedrooms, Calathea adds an exotic, aesthetic appeal to interior décor. With moderate care, it thrives indoors and becomes a centerpiece showcasing texture, pattern, and elegance.",
    "image": "https://images.unsplash.com/photo-1667395941567-9892435d0240?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8Q2FsYXRoZWF8ZW58MHx8MHx8fDA%3D",
    "providerName": "Bloomy Home"
  },
  {
    "plantId": 19,
    "plantName": "Pothos",
    "category": "Beginner Friendly",
    "price": 21,
    "rating": 4.8,
    "availableStock": 15,
    "careLevel": "Easy",
    "lightRequirement": "Low to medium indirect light",
    "waterFrequency": "Once a week",
    "size": "Medium (1-2 ft)",
    "origin": "Southeast Asia",
    "benefits": "Air purification, beginner-friendly, trailing foliage",
    "description": "Pothos is a popular indoor trailing plant known for its heart-shaped, variegated leaves and exceptional ease of care. Thriving in low to medium indirect light, it requires watering only once a week and is highly tolerant of neglect, making it ideal for beginners or busy homeowners. Pothos can be grown in hanging baskets, on shelves, or trained to climb supports, adding versatility to interior décor. Its lush, cascading foliage purifies the air by removing toxins such as formaldehyde, benzene, and xylene. Pothos enhances both aesthetics and indoor air quality, creating a natural, vibrant, and inviting atmosphere in homes, offices, or small apartments.",
    "image": "https://images.unsplash.com/photo-1537039557108-4a42c334fd5e?w=900&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8UG90aG9zfGVufDB8fDB8fHww",
    "providerName": "HangingGreen Studios"
  },
  {
    "plantId": 20,
    "plantName": "Hoya Carnosa",
    "category": "Flowering Indoor",
    "price": 30,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Easy",
    "lightRequirement": "Bright indirect light",
    "waterFrequency": "Every 1-2 weeks",
    "size": "Medium (1.5-2 ft)",
    "origin": "Southeast Asia",
    "benefits": "Trailing foliage, fragrant blooms, low maintenance",
    "description": "Hoya Carnosa is a trailing indoor vine with thick, waxy leaves and clusters of fragrant, star-shaped flowers that bloom periodically. It thrives in bright indirect light and requires watering every 1-2 weeks, making it an easy-care option for indoor gardening enthusiasts. The plant's trailing habit allows it to cascade elegantly from shelves, hanging baskets, or mounted supports, adding a lush, decorative touch to interiors. Its delicate flowers emit a sweet fragrance that enhances the ambiance of any space. Hoya Carnosa is resilient, low-maintenance, and ideal for both beginners and experienced plant lovers. It contributes to indoor aesthetics, air purification, and a relaxing, natural atmosphere.",
    "image": "https://media.istockphoto.com/id/2229344450/photo/hoya-carnosa-is-a-flowering-plant-native-to-east-asia-with-waxy-leaves-and-scented-flowers.webp?a=1&b=1&s=612x612&w=0&k=20&c=BslidmdvrNqaVgT9-2LmcidRp-9dD5Qhep3KriRv1Rk=",
    "providerName": "TropiLeaf Designs"
  }
]
